In [5]:
import pandas as pd
from pandasql import sqldf

In [2]:
df = pd.read_csv("final_output.csv")
df

     team  role
0       1     9
1       1     6
2       1     2
3       1     5
4       1     8
..    ...   ...
485    98     9
486    98     3
487    98    10
488    98     6
489    98     1

[490 rows x 2 columns]

In [4]:
df['line'] = df['role'].apply(lambda x: 'front' if x <= 3 else 'back' if x <= 6 else 'mid')
df

     team  role   line
0       1     9    mid
1       1     6   back
2       1     2  front
3       1     5   back
4       1     8    mid
..    ...   ...    ...
485    98     9    mid
486    98     3  front
487    98    10    mid
488    98     6   back
489    98     1  front

[490 rows x 3 columns]

In [7]:
result = sqldf("""
SELECT
  team,
  SUM(CASE WHEN line = 'mid' THEN 1 ELSE 0 END) AS mids,
  SUM(CASE WHEN line = 'back' THEN 1 ELSE 0 END) AS backs,
  SUM(CASE WHEN line = 'front' THEN 1 ELSE 0 END) AS fronts
FROM df
GROUP BY 1
""", locals())
result.to_csv("see_result.csv", index=False)
result

    team  mids  backs  fronts
0      1     2      2       1
1      2     1      2       2
2      3     2      1       2
3      4     2      2       1
4      5     2      2       1
..   ...   ...    ...     ...
93    94     1      2       2
94    95     1      2       2
95    96     2      2       1
96    97     3      0       2
97    98     2      1       2

[98 rows x 4 columns]

In [8]:
result2 = sqldf("""
SELECT
mids,
backs,
fronts,
count(*) n
FROM
    (SELECT
      team,
      SUM(CASE WHEN line = 'mid' THEN 1 ELSE 0 END) AS mids,
      SUM(CASE WHEN line = 'back' THEN 1 ELSE 0 END) AS backs,
      SUM(CASE WHEN line = 'front' THEN 1 ELSE 0 END) AS fronts
    FROM df
    GROUP BY 1
    ) a
GROUP BY 1,2,3 ORDER BY 4 DESC
""", locals())
result2.to_csv("see_result2.csv", index=False)
result2

    mids  backs  fronts   n
0      2      2       1  28
1      1      2       2  22
2      2      1       2  11
3      0      2       3   9
4      3      1       1   7
5      1      1       3   5
6      1      3       1   5
7      3      2       0   4
8      0      3       2   2
9      0      1       4   1
10     0      4       1   1
11     2      3       0   1
12     3      0       2   1
13     4      0       1   1

In [9]:
result3 = sqldf("""
SELECT
mids,
backs,
fronts,
enchanters,
count(*) n
FROM
    (SELECT
      team,
      SUM(CASE WHEN line = 'mid' THEN 1 ELSE 0 END) AS mids,
      SUM(CASE WHEN line = 'back' THEN 1 ELSE 0 END) AS backs,
      SUM(CASE WHEN line = 'front' THEN 1 ELSE 0 END) AS fronts,
      SUM(CASE WHEN role = 4 THEN 1 ELSE 0 END) AS enchanters
    FROM df
    GROUP BY 1
    ) a
GROUP BY 1,2,3,4 ORDER BY 5 DESC
""", locals())
result3.to_csv("see_result3.csv", index=False)
result3

    mids  backs  fronts  enchanters   n
0      2      2       1           0  26
1      1      2       2           0  21
2      2      1       2           0  11
3      0      2       3           0   9
4      3      1       1           0   6
5      1      1       3           0   5
6      1      3       1           0   5
7      3      2       0           0   4
8      2      2       1           1   2
9      0      1       4           0   1
10     0      3       2           0   1
11     0      3       2           1   1
12     0      4       1           0   1
13     1      2       2           1   1
14     2      3       0           0   1
15     3      0       2           0   1
16     3      1       1           1   1
17     4      0       1           0   1

In [29]:
result4 = sqldf("""
SELECT
in_role,
count(*) n
FROM
    (SELECT
      team,
      SUM(CASE WHEN role = 9 THEN 1 ELSE 0 END) AS in_role
    FROM df
    GROUP BY 1
    ) a
GROUP BY 1 ORDER BY 2 DESC
""", locals())
result4.to_csv("see_result4.csv", index=False)
result4

   in_role   n
0        0  53
1        1  41
2        2   4

In [24]:
import numpy as np
np.cumsum(df.role.value_counts(normalize=True))

6     0.212245
2     0.367347
5     0.508163
1     0.612245
9     0.712245
7     0.783673
3     0.851020
8     0.914286
11    0.963265
10    0.989796
4     1.000000
Name: role, dtype: float64